In [2]:
#we will write sql queries in jupyter notebook with python like syntax

#import libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [3]:
#going to create a function that will help us create a server connection

def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:                                    # we will be using exception handling techniques to connect to our mysql server
        connection = mysql.connector.connect(
            host = host_name,                   #mysql.connector.connect sets up a connection.It establishes a session with mysql server 
            user = user_name,                   #if no arguments are passed, it uses the already configured or default values.
            passwd = user_password
        )
        print("MySql Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection
              
#put our mysql terminal password
pw = "Learn@123"

#Database name 
db = "mysql_python"
connection = create_server_connection("localhost", "root", pw)

MySql Database connection successful

In [11]:
#to create database mysql_python
#to create this database we will create another user defined function
def create_database(connection, query):
    cursor = connection.cursor()        #this mysql cursor of mysql connector python is used to execute statements to communicate with mysql database
                                        #(used to execute statements of mysql using python language). 
                                        #mysql cursor class initiates objects that can execute operations such as mysql statements
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error:'{err}'")
create_database_query = "create database mysql_python"
create_database(connection,create_database_query)

Error:'1007 (HY000): Can't create database 'mysql_python'; database exists'

In [4]:
#connect to database
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name)
        print("MySql database connection successful")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [5]:
#Execute sql queries
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error: '{err}'")

In [24]:
#to create first table in mysql_python database
#we will assign our sql command to a python variable using """ to create a multiLine stream
#""" will ensure i can create my multi line stream. Inside the """ we will write create table commnad
create_orders_table = """
create table orders(order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_orderd date,
quantity int,
unit_price float,
phone varchar(20));
"""
#to run this we call our create_db function
#connect to database
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySql database connection successful
Query was successful

In [6]:
#Insert records into table

data_orders = """
insert into orders values
(101, "steve", "Laptop", '2018-06-12', 2, 800, 6293730802),
(102, "Jos" , "books", '2019-02-10',10,12,8976543210),
(103, "Stacy", "Trousers", '2019-12-25', 5, 50, 876548976),
(104, "Nancy", "T-Shirts", '2020-01-20', 4, 100, 7897673636),
(105, "Maria", "Headphones", '2021-02-25', 3, 200, 959395738),
(106, 'Dany', 'Smart Tv', '2022-08-20', 10, 300, 7493746593);
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, data_orders)

MySql database connection successful
Query was successful

In [8]:
#to read query and display results

def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [9]:
#using select statement

q1 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySql database connection successful
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Jos', 'books', datetime.date(2019, 2, 10), 10, 12.0, '8976543210')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '876548976')
(104, 'Nancy', 'T-Shirts', datetime.date(2020, 1, 20), 4, 100.0, '7897673636')
(105, 'Maria', 'Headphones', datetime.date(2021, 2, 25), 3, 200.0, '959395738')
(106, 'Dany', 'Smart Tv', datetime.date(2022, 8, 20), 10, 300.0, '7493746593')

In [10]:
q2 = """
select customer_name, phone from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySql database connection successful
('steve', '6293730802')
('Jos', '8976543210')
('Stacy', '876548976')
('Nancy', '7897673636')
('Maria', '959395738')
('Dany', '7493746593')

In [12]:
q3 = """
select year(date_orderd) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySql database connection successful
(2018,)
(2019,)
(2019,)
(2020,)
(2021,)
(2022,)

In [13]:
q4 = """
select distinct year(date_orderd) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySql database connection successful
(2018,)
(2019,)
(2020,)
(2021,)
(2022,)

In [14]:
q5 = """
select * from orders where date_orderd <2018-12-31;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySql database connection successful
(2018,)
(2019,)
(2020,)
(2021,)
(2022,)

In [15]:
q6 = """
select * from orders order by unit_price;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySql database connection successful
(102, 'Jos', 'books', datetime.date(2019, 2, 10), 10, 12.0, '8976543210')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '876548976')
(104, 'Nancy', 'T-Shirts', datetime.date(2020, 1, 20), 4, 100.0, '7897673636')
(105, 'Maria', 'Headphones', datetime.date(2021, 2, 25), 3, 200.0, '959395738')
(106, 'Dany', 'Smart Tv', datetime.date(2022, 8, 20), 10, 300.0, '7493746593')
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')

In [18]:
#create a data frame from a given table
#using pandas and jupyter notebook we can create data frames
from_db = [] #empty list
#we are going to create a list of lists and then create a pandas data frame
for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", "customer_name", "product_name", "date_orderd", "quantity",
           "unit_price","phone"]
df = pd.DataFrame(from_db, columns = columns)
display(df)

,order_id,customer_name,product_name,date_orderd,quantity,unit_price,phone
0,102,Jos,books,2019-02-10,10,12.0,8976543210
1,103,Stacy,Trousers,2019-12-25,5,50.0,876548976
2,104,Nancy,T-Shirts,2020-01-20,4,100.0,7897673636
3,105,Maria,Headphones,2021-02-25,3,200.0,959395738
4,106,Dany,Smart Tv,2022-08-20,10,300.0,7493746593
5,101,steve,Laptop,2018-06-12,2,800.0,6293730802

In [20]:
#Update command
#to change unit price of one of the orders we can use update command
update = """ 
update orders
set unit_price = 45 
where order_id = 103;
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, update)

MySql database connection successful
Query was successful

In [21]:
q7 = """
select * from orders where order_id = 103;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

MySql database connection successful
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '876548976')

In [22]:
#Delete a record
delete_order = """
delete from orders
where order_id = 105;
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, delete_order)

MySql database connection successful
Query was successful

In [23]:
q8 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySql database connection successful
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Jos', 'books', datetime.date(2019, 2, 10), 10, 12.0, '8976543210')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '876548976')
(104, 'Nancy', 'T-Shirts', datetime.date(2020, 1, 20), 4, 100.0, '7897673636')
(106, 'Dany', 'Smart Tv', datetime.date(2022, 8, 20), 10, 300.0, '7493746593')